import '../css/mainPage.css'

export default function MainContent() {
  return (
    <article>
        <section className="purpose">
          <dl>
            <dt><b>Мета:</b></dt>
            <dd>
              Метою створення інтернет-магазину є забезпечення зручної платформи
              для продажу та придбання сучасних нейромережевих рішень.
              Магазин надаватиме користувачам доступ до широкого асортименту
              готових моделей, які можна інтегрувати у власні проєкти.
            </dd>
          </dl>
          <p><b>Перелік завдань для досягення цілі</b></p>
          <ol>
            <li>Розробити зручний та інтуїтивно зрозумілий інтерфейс...</li>
            <li>Забезпечити безпечну систему оплати...</li>
            <li>Створити каталог з докладними описами...</li>
          </ol>
        </section>

        <section className="table_info">
          <table>
            <thead>
              <tr><th colSpan="5"><em>Основні типи штучних нейронних мереж</em></th></tr>
              <tr>
                <th>Види нейромереж</th>
                <th>Призначення</th>
                <th>Архітектура</th>
                <th>Переваги</th>
                <th>Приклади використання</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td rowSpan="2">Perceptron</td>
                <td colSpan="2">Базовий підхід до класифікації</td>
                <td>Простота</td>
                <td>Розпізнавання простих образів</td>
              </tr>
              <tr>
                <td>Навчання з учителем</td>
                <td>Один шар нейронів</td>
                <td colSpan="2">Швидке навчання та реалізація</td>
              </tr>
              <tr>
                <td>CNN</td><td>Аналіз зображень</td><td>Шари згорток і підвибірки</td>
                <td>Висока точність</td><td>Розпізнавання облич</td>
              </tr>
              <tr>
                <td>RNN</td><td>Обробка послідовностей</td><td>Петльова структура</td>
                <td>Пам’ять станів</td><td>Аналіз тексту</td>
              </tr>
              <tr>
                <td>LSTM</td><td>Робота з довгими послідовностями</td><td>Комірки пам’яті</td>
                <td>Утримує довгу історію</td><td>Чат-боти, переклад</td>
              </tr>
              <tr>
                <td>GAN</td><td>Генерація нових даних</td><td>Генератор і дискримінатор</td>
                <td>Створює реалістичні дані</td><td>Створення зображень</td>
              </tr>
            </tbody>
            <tfoot>
              <tr>
                <td colSpan="5">
                  <i><span style={{ color: 'red' }}>Узагальнена інформація...</span></i>
                </td>
              </tr>
            </tfoot>
          </table>
        </section>
      </article>    
  );
}